In [1]:
import pandas as pd
import numpy as np
import os
import dask.dataframe as dd
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r'C:\Users\Home\Desktop\Career Foundry- Data Analyst.2\Instacart Basket Analysis'

In [3]:
df_customers = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'))

In [ ]:
df_customers.head()

In [17]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   user_id        206209 non-null  int64
 1   first_name     194950 non-null  object
 2   Surname        206209 non-null  object
 3   Gender         206209 non-null  object
 4   State          206209 non-null  object
 5   Age            206209 non-null  int64
 6   date_joined    206209 non-null  datetime64[ns]
 7   n_dependants   206209 non-null  int64
 8   family_status  206209 non-null  object
 9   income         206209 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(5)
memory usage: 15.7+ MB

# Wrangle the data

In [4]:
df_customers.rename(columns={'First Name':'first_name', 'Surnam':'Surname', 'STATE':'State', 'fam_status':'family_status'}, inplace=True)

In [5]:
df_customers.head()

,user_id,first_name,Surname,Gender,State,Age,date_joined,n_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Complete the fundamental data quality and consistency checks

In [6]:
duplicated = df_customers[df_customers.duplicated()]
duplicated

Empty DataFrame
Columns: [user_id, first_name, Surname, Gender, State, Age, date_joined, n_dependants, family_status, income]
Index: []

There is no dublicate row

In [7]:
df_customers.isnull().sum()

user_id              0
first_name       11259
Surname              0
Gender               0
State                0
Age                  0
date_joined          0
n_dependants         0
family_status        0
income               0
dtype: int64

In [8]:
df_customers['date_joined']=pd.to_datetime(df_customers['date_joined'])

# 6. Combine your customer data with the rest of your prepared Instacart data

In [13]:
df_large.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434212 entries, 0 to 32434211
Data columns (total 27 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   eval_set                object
 3   order_number            int64
 4   orders_day_of_week      int64
 5   order_hour_of_day       int64
 6   days_since_prior_order  float64
 7   product_id              int64
 8   add_to_cart_order       int64
 9   reordered               int64
 10  _merge                  category
 11  product_name            object
 12  aisle_id                int64
 13  department_id           int64
 14  prices                  float64
 15  merge_indicator         category
 16  price_range_loc         object
 17  busiest_day             object
 18  busiest_days            object
 19  result_3                object
 20  busiest_period_of_day   object
 21  max_order               int64
 22  loyalty_flag            object
 23  average_spend           float64
 24  spender_flag            object
 25  Customer_frequency      float64
 26  frequency_flag          object
dtypes: category(2), float64(4), int64(11), object(10)
memory usage: 6.1+ GB

In [16]:
df_large['order_id'].nunique()

3214861

In [9]:
df_large=pd.read_pickle(os.path.join(path,'Data', 'Prepared data', 'ords_prods_merge_aggregated.pkl'))

In [18]:
percent_to_select = 0.1
df_v1 = df_large.sample(frac=percent_to_select, random_state=42)

In [19]:
df_v1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3243421 entries, 18445142 to 3096072
Data columns (total 27 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   eval_set                object
 3   order_number            int64
 4   orders_day_of_week      int64
 5   order_hour_of_day       int64
 6   days_since_prior_order  float64
 7   product_id              int64
 8   add_to_cart_order       int64
 9   reordered               int64
 10  _merge                  category
 11  product_name            object
 12  aisle_id                int64
 13  department_id           int64
 14  prices                  float64
 15  merge_indicator         category
 16  price_range_loc         object
 17  busiest_day             object
 18  busiest_days            object
 19  result_3                object
 20  busiest_period_of_day   object
 21  max_order               int64
 22  loyalty_flag            object
 23  average_spend           float64
 24  spender_flag            object
 25  Customer_frequency      float64
 26  frequency_flag          object
dtypes: category(2), float64(4), int64(11), object(10)
memory usage: 649.6+ MB

In [20]:
df_merged = df_v1.merge(df_customers, on='user_id', indicator='my_indicator_column')

In [21]:
df_merged.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,first_name,Surname,Gender,State,Age,date_joined,n_dependants,family_status,income,my_indicator_column
0,3204302,158116,prior,9,0,11,7.0,19938,4,0,...,James,Glenn,Male,Iowa,25,2017-07-21,1,married,71430,both
1,1415564,158116,prior,8,0,9,27.0,8277,17,0,...,James,Glenn,Male,Iowa,25,2017-07-21,1,married,71430,both
2,2019627,158116,prior,6,5,17,5.0,34969,17,0,...,James,Glenn,Male,Iowa,25,2017-07-21,1,married,71430,both
3,1378290,158116,prior,13,6,12,27.0,18583,26,0,...,James,Glenn,Male,Iowa,25,2017-07-21,1,married,71430,both
4,1923556,158116,prior,5,0,21,13.0,47734,10,0,...,James,Glenn,Male,Iowa,25,2017-07-21,1,married,71430,both

In [23]:
df_merged.to_pickle(os.path.join(path, 'Data', 'Prepared Data', 'ords_prods_merge_aggregated_2.pkl'))